# MultiReferenceAnnotationId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..MultiReferenceAnnotationId Property
IndependentTag Class See Also
---
The multi-reference annotation which owns this tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId MultiReferenceAnnotationId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MultiReferenceAnnotationId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MultiReferenceAnnotationId {
	ElementId^ get ();
}
```

# Remarks
[!:Autodesk::Revit::DB::MultiReferenceAnnotation] for more information.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace